alwin-middleware-grapescode/alwin-rest/src/test/resources/messages/request/demand/processDemandForPayment.json

{
  "demandsToSend": [
    {
      "id": 1,
      "issueDate": 1499763600000,
      "dueDate": 1501752000000,
      "initialInvoiceNo": "000001/10/2020/RL/PO/LW",
      "extCompanyId": 9999,
      "contractNumber": "issue_21_00002/15/1",
      "type": {
        "id": 1,
        "key": "FIRST",
        "dpdStart": 10,
        "numberOfDaysToPay": 9,
        "charge": 23.22,
        "segment": {
          "key": "A",
          "label": "A"
        },
        "minDuePaymentValue": 100.00,
        "minDuePaymentPercent": 20.00
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/10/2017",
      "state": "NEW",
      "attachmentRef": "http://grapescode.pl/download/attachment1Link.pdf",
      "invoices": [
        {
          "id": 15,
          "invoiceNumber": "000001/10/2020/RL/PO/LW",
          "contractNumber": "issue_21_00002/15/1",
          "issueDate": 1542236400000,
          "dueDate": 1606777200000,
          "currency": "PLN",
          "netAmount": 100.91,
          "grossAmount": 124.12,
          "currentBalance": -124.12
        },
        {
          "id": 11,
          "invoiceNumber": "000001/10/2024/RL/PO/LW",
          "contractNumber": "issue_21_00002/15/1",
          "issueDate": 1541977200000,
          "dueDate": 1727820000000,
          "currency": "EUR",
          "netAmount": 100.91,
          "grossAmount": 124.12,
          "currentBalance": -124.12
        }
      ]
    }
  ],
  "demandsToReject": [
    {
      "id": 2,
      "issueDate": 1501578000000,
      "dueDate": 1505294400000,
      "initialInvoiceNo": "000001/12/2020/RL/PO/LW",
      "extCompanyId": 9999,
      "contractNumber": "issue_21_00001/15/1",
      "type": {
        "id": 2,
        "key": "SECOND",
        "dpdStart": 20,
        "numberOfDaysToPay": 14,
        "charge": 123.23,
        "segment": {
          "key": "A",
          "label": "A"
        },
        "minDuePaymentValue": 10.00,
        "minDuePaymentPercent": null
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/11/2017",
      "state": "NEW",
      "attachmentRef": "http://grapescode.pl/download/attachment2Link.pdf",
      "invoices": [
        {
          "id": 10,
          "invoiceNumber": "000001/12/2020/RL/PO/LW",
          "contractNumber": "issue_21_00001/15/1",
          "issueDate": 1541804400000,
          "dueDate": 1606777200000,
          "currency": "EUR",
          "netAmount": 154.66,
          "grossAmount": 190.23,
          "currentBalance": -190.23
        }
      ]
    }
  ],
  "rejectReason": "Powód odrzucenia"
}
